nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8400/driver_examples/dac/ext_triggered_waveform/pin_mux.h
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC2 (number 5), J4[1]/J502[12]/J9[2]/J500A[B62]/TXD0
  @{ */
#define BOARD_BUTTON_SW1_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_BUTTON_SW1_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_BUTTON_SW1_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
